<a href="https://colab.research.google.com/github/ShubhamDhakarey/Solve_Question/blob/main/Assignment_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Shubham Dhakarey**
**MCAN1CA22025**

**MCA-205 Data Science using Python**

**Practical Assignment-2**

**1. Write the code for the given task**

**Use the below link for the source of the data set and solve the exercise.**https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user

**a) Import the dataset**

In [1]:
import pandas as pd
import numpy as np
url='https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
data=pd.read_csv(url)
data.to_csv('dataset.csv',index=False)

In [2]:
df=pd.read_csv('dataset.csv')

In [3]:
df

    user_id|age|gender|occupation|zip_code
0                  1|24|M|technician|85711
1                       2|53|F|other|94043
2                      3|23|M|writer|32067
3                  4|24|M|technician|43537
4                       5|33|F|other|15213
..                                     ...
938                 939|26|F|student|33319
939           940|32|M|administrator|02215
940                 941|20|M|student|97229
941               942|48|F|librarian|78209
942                 943|22|M|student|77841

[943 rows x 1 columns]

In [4]:
a=df['user_id|age|gender|occupation|zip_code'].str.split(pat = '|', expand = True)

In [5]:
df[['user_id','age','gender','occupation','zip_code']] = a

**Show the 25 first entries**

In [6]:
df.head(25)

,user_id|age|gender|occupation|zip_code,user_id,age,gender,occupation,zip_code
0,1|24|M|technician|85711,1,24,M,technician,85711
1,2|53|F|other|94043,2,53,F,other,94043
2,3|23|M|writer|32067,3,23,M,writer,32067
3,4|24|M|technician|43537,4,24,M,technician,43537
4,5|33|F|other|15213,5,33,F,other,15213
5,6|42|M|executive|98101,6,42,M,executive,98101
6,7|57|M|administrator|91344,7,57,M,administrator,91344
7,8|36|M|administrator|05201,8,36,M,administrator,05201
8,9|29|M|student|01002,9,29,M,student,01002
9,10|53|M|lawyer|90703,10,53,M,lawyer,90703
10,11|39|F|other|30329,11,39,F,other,30329
11,12|28|F|other|06405,12,28,F,other,06405
12,13|47|M|educator|29206,13,47,M,educator,29206
13,14|45|M|scientist|55106,14,45,M,scientist,55106
14,15|49|F|educator|97301,15,49,F,educator,97301
15,16|21|M|entertainment|10309,16,21,M,entertainment,10309
16,17|30|M|programmer|06355,17,30,M,programmer,06355
17,18|35|F|other|37212,18,35,F,other,37212
18,19|40|M|librarian|02138,19,40,M,librarian,02138
19,20|42|F|homemaker|95660,20,42,F,homemaker,95660
20,21|26|M|writer|30068,21,26,M,writer,30068
21,22|25|M|writer|40206,22,25,M,writer,40206
22,23|30|F|artist|48197,23,30,F,artist,48197
23,24|21|F|artist|94533,24,21,F,artist,94533
24,25|39|M|engineer|55107,25,39,M,engineer,55107

In [7]:
a=df.drop(['user_id|age|gender|occupation|zip_code'],axis=1)

In [8]:
a

    user_id age gender     occupation zip_code
0         1  24      M     technician    85711
1         2  53      F          other    94043
2         3  23      M         writer    32067
3         4  24      M     technician    43537
4         5  33      F          other    15213
..      ...  ..    ...            ...      ...
938     939  26      F        student    33319
939     940  32      M  administrator    02215
940     941  20      M        student    97229
941     942  48      F      librarian    78209
942     943  22      M        student    77841

[943 rows x 5 columns]

**c) How many observations in the dataset**

In [9]:
observation=df.shape[0]
print("Total no. of observations: ",observation)

Total no. of observations:  943

**d) Print the name of all the columns.**

In [10]:
print(df.columns)

Index(['user_id|age|gender|occupation|zip_code', 'user_id', 'age', 'gender',
       'occupation', 'zip_code'],
      dtype='object')

**e) What is the data type of each column?**

In [11]:
df.dtypes

user_id|age|gender|occupation|zip_code    object
user_id                                   object
age                                       object
gender                                    object
occupation                                object
zip_code                                  object
dtype: object

**f) Print only the occupation column**

In [12]:
df['occupation']

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

In [13]:
df.occupation

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

**g) How many different occupations are in this dataset?**

In [14]:
df.groupby(by='occupation').occupation.count()

occupation
administrator     79
artist            28
doctor             7
educator          95
engineer          67
entertainment     18
executive         32
healthcare        16
homemaker          7
lawyer            12
librarian         51
marketing         26
none               9
other            105
programmer        66
retired           14
salesman          12
scientist         31
student          196
technician        27
writer            45
Name: occupation, dtype: int64

**h) Summarize the DataFrame.**

In [15]:
df.describe()

,user_id|age|gender|occupation|zip_code,user_id,age,gender,occupation,zip_code
count,943,943,943,943,943,943
unique,943,943,61,2,21,795
top,1|24|M|technician|85711,1,30,M,student,55414
freq,1,1,39,670,196,9

**i) Summarize all the columns**

In [16]:
df.describe(include='all')

,user_id|age|gender|occupation|zip_code,user_id,age,gender,occupation,zip_code
count,943,943,943,943,943,943
unique,943,943,61,2,21,795
top,1|24|M|technician|85711,1,30,M,student,55414
freq,1,1,39,670,196,9

**j) Summarize only the occupation column**

In [17]:
df.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object